test/tests/multiapps/temperature_set_on_openfoam_boundary/par/buoyantCavity/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.000375;

boundaryField
{
    patch0
    {
        type            kqRWallFunction;
        value           uniform 0.000375;
    }
    patch1
    {
        type            kqRWallFunction;
        value           uniform 0.000375;
    }
    patch2
    {
        type            kqRWallFunction;
        value           uniform 0.000375;
    }
    patch3
    {
        type            kqRWallFunction;
        value           uniform 0.000375;
    }
    patch4
    {
        type            kqRWallFunction;
        value           uniform 0.000375;
    }
    patch5
    {
        type            kqRWallFunction;
        value           uniform 0.000375;
    }
}


// ************************************************************************* //
